In [115]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
pd.options.display.float_format = "{:.2f}".format

In [3]:
transactions = pd.read_csv('./transactions.csv')

In [6]:
products = pd.read_csv('./products.csv')

In [7]:
markets = pd.read_csv('./markets.csv')

In [8]:
customers = pd.read_csv('./customers.csv')

In [9]:
date = pd.read_csv('./date.csv')

In [10]:
transactions.head(3)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR
1,Prod001,Cus002,Mark002,2018-05-08,3,-1.00,INR
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR

In [11]:
products.sample(2)

    product_code product_type
197      Prod198    Own Brand
81       Prod082    Own Brand

In [12]:
customers.sample(2)

   customer_code custmer_name customer_type
26        Cus027      Control    E-Commerce
32        Cus033      All-Out    E-Commerce

In [13]:
markets.sample(2)

   markets_code markets_name     zone
12      Mark013       Bhopal  Central
9       Mark010        Kochi    South

In [14]:
date.sample(2)

           date     cy_date  year month_name date_yy_mmm
403  2018-07-09  2018-07-01  2018       July      18-Jul
810  2019-08-20  2019-08-01  2019     August      19-Aug

In [15]:
transactions.dtypes

product_code      object
customer_code     object
market_code       object
order_date        object
sales_qty          int64
sales_amount     float64
currency          object
dtype: object

In [16]:
transactions.isnull().sum()

product_code     0
customer_code    0
market_code      0
order_date       0
sales_qty        0
sales_amount     0
currency         0
dtype: int64

In [17]:
transactions[transactions['sales_amount'] <= 0].sample(3)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
6698,Prod053,Cus002,Mark006,2018-05-10,1,0.00,INR
146584,Prod334,Cus015,Mark003,2019-10-03,1,0.00,INR
5751,Prod053,Cus002,Mark006,2017-10-19,1,0.00,INR

In [18]:
len(transactions[transactions['sales_amount'] <= 0])

1611

In [19]:
transactions.shape

(150283, 7)

In [20]:
transactions.drop(transactions[transactions['sales_amount'] <= 0].index, inplace=True)

In [21]:
transactions.shape

(148672, 7)

In [22]:
transactions['currency'].unique()

array(['INR', 'USD'], dtype=object)

In [23]:
transactions[transactions['currency'] == 'USD']

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
5,Prod003,Cus005,Mark004,2017-11-20,59,500.00,USD
6,Prod003,Cus005,Mark004,2017-11-22,36,250.00,USD
286,Prod003,Cus005,Mark004,2017-11-20,59,500.00,USD
287,Prod003,Cus005,Mark004,2017-11-22,36,250.00,USD

In [24]:
transactions[transactions['currency'] == 'USD']['sales_amount']

5     500.00
6     250.00
286   500.00
287   250.00
Name: sales_amount, dtype: float64

In [25]:
val = transactions[transactions['currency'] == 'USD'].index

In [26]:
val

Index([5, 6, 286, 287], dtype='int64')

In [27]:
for x in val:
    transactions.at[x,'sales_amount'] = transactions.at[x,'sales_amount']*75
    transactions.at[x,'currency'] = 'INR'

In [28]:
transactions.loc[val]

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency
5,Prod003,Cus005,Mark004,2017-11-20,59,37500.00,INR
6,Prod003,Cus005,Mark004,2017-11-22,36,18750.00,INR
286,Prod003,Cus005,Mark004,2017-11-20,59,37500.00,INR
287,Prod003,Cus005,Mark004,2017-11-22,36,18750.00,INR

In [29]:
transactions['product_price'] = transactions['sales_amount'] / transactions['sales_qty']

In [30]:
transactions.head(4)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00

In [31]:
transactions.isnull().sum()

product_code     0
customer_code    0
market_code      0
order_date       0
sales_qty        0
sales_amount     0
currency         0
product_price    0
dtype: int64

In [32]:
def calc_perc(y):
    profit = 8
    
    if y > 4000:
        profit = 23
    elif y > 3000:
        profit = 19
    elif y > 2000:
        profit = 17
    elif y > 1000:
        profit = 15
    elif y > 500:
        profit = 13
    elif y > 100:
        profit = 11
    else:
        profit = 8
        
    return profit

In [33]:
transactions['profit_percentage'] = transactions['product_price'].apply(calc_perc)

In [34]:
transactions.head()

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00,15
5,Prod003,Cus005,Mark004,2017-11-20,59,37500.00,INR,635.59,13

In [35]:
transactions.shape

(148672, 9)

In [36]:
transactions['profit_percentage'].isnull().sum()

0

In [37]:
transactions.isnull().sum()

product_code         0
customer_code        0
market_code          0
order_date           0
sales_qty            0
sales_amount         0
currency             0
product_price        0
profit_percentage    0
dtype: int64

In [38]:
transactions['original_price'] = (transactions['product_price'] - (transactions['product_price']*(transactions['profit_percentage'] / 100)))

In [39]:
transactions.head(4)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13,507.21
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00,15,1016.60

In [40]:
transactions['profit'] = transactions['product_price']*(transactions['profit_percentage'] / 100)

In [41]:
transactions.head(4)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25,113.75
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13,507.21,75.79
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00,15,1016.60,179.40

In [42]:
transactions['total_profit'] = (transactions['sales_qty'])*(transactions['product_price']*(transactions['profit_percentage'] / 100))

In [43]:
transactions.head(4)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25,113.75,113.75
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13,507.21,75.79,75.79
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00,15,1016.60,179.40,1076.40

In [44]:
transactions['total_cost'] = (transactions['sales_amount'])-(transactions['total_profit'])

In [45]:
transactions.head(4)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit,total_cost
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51,36704.49
2,Prod002,Cus003,Mark003,2018-04-06,1,875.00,INR,875.00,13,761.25,113.75,113.75,761.25
3,Prod002,Cus003,Mark003,2018-04-11,1,583.00,INR,583.00,13,507.21,75.79,75.79,507.21
4,Prod002,Cus004,Mark003,2018-06-18,6,7176.00,INR,1196.00,15,1016.60,179.40,1076.40,6099.60

In [46]:
transactions['sales_amount'].sum()

986676768.0

In [47]:
transactions['total_cost'].sum()

849375728.9

In [48]:
transactions['total_profit'].sum()

137301039.1

In [49]:
(transactions['total_cost'].sum() + transactions['total_profit'].sum()) - transactions['sales_amount'].sum()

0.0

In [50]:
transactions.shape

(148672, 13)

In [51]:
products.head(3)

  product_code product_type
0      Prod001    Own Brand
1      Prod002    Own Brand
2      Prod003    Own Brand

In [52]:
products['product_type'].unique()

array(['Own Brand', 'Distribution'], dtype=object)

In [53]:
products['product_code'].nunique()

279

In [54]:
len(products[products['product_type'] == 'Own Brand'])

191

In [55]:
len(products[products['product_type'] == 'Distribution'])

88

In [56]:
transactions['product_code'].nunique()

338

In [57]:
prod_code1 = pd.Series(products['product_code'].unique())

In [58]:
prod_code2 = pd.Series(transactions['product_code'].unique())

In [59]:
prod_code1.tail()

274    Prod275
275    Prod276
276    Prod277
277    Prod278
278    Prod279
dtype: object

In [60]:
prod_code2.tail()

333    Prod335
334    Prod336
335    Prod337
336    Prod338
337    Prod339
dtype: object

In [63]:
products['product_code'].nunique()

279

In [64]:

products.tail()

    product_code  product_type
274      Prod275     Own Brand
275      Prod276     Own Brand
276      Prod277     Own Brand
277      Prod278  Distribution
278      Prod279  Distribution

In [65]:
transactions.shape

(148672, 13)

In [66]:
transactions2 = pd.merge(transactions, products, how='inner', on='product_code')

In [67]:
transactions2.sample(3)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit,total_cost,product_type
49958,Prod134,Cus005,Mark004,2019-01-08,12,3935.00,INR,327.92,11,291.85,36.07,432.85,3502.15,Own Brand
44612,Prod129,Cus020,Mark004,2018-11-22,1,167.00,INR,167.00,11,148.63,18.37,18.37,148.63,Distribution
79421,Prod265,Cus020,Mark011,2020-06-11,1,245.00,INR,245.00,11,218.05,26.95,26.95,218.05,Distribution

In [68]:
transactions2.shape

(94073, 14)

In [69]:
customers.head(3)

  customer_code  custmer_name   customer_type
0        Cus001  Surge Stores  Brick & Mortar
1        Cus002  Nomad Stores  Brick & Mortar
2        Cus003  Excel Stores  Brick & Mortar

In [70]:
customers['customer_type'].unique()

array(['Brick & Mortar', 'E-Commerce'], dtype=object)

In [71]:
customers['customer_type'].nunique()

2

In [72]:
customers['customer_code'].nunique()

38

In [73]:
transactions2['customer_code'].nunique()

38

In [74]:
transactions2.shape

(94073, 14)

In [75]:
transactions3 = pd.merge(transactions2, customers, how='inner', on='customer_code')

In [76]:
transactions3.sample(3)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit,total_cost,product_type,custmer_name,customer_type
32301,Prod005,Cus007,Mark004,2019-10-28,7,2574.00,INR,367.71,11,327.27,40.45,283.14,2290.86,Own Brand,Info Stores,Brick & Mortar
87335,Prod053,Cus036,Mark007,2017-10-16,7,1991.00,INR,284.43,11,253.14,31.29,219.01,1771.99,Own Brand,Novus,E-Commerce
41860,Prod064,Cus012,Mark003,2017-11-09,8,2204.00,INR,275.50,11,245.19,30.30,242.44,1961.56,Own Brand,Integration Stores,Brick & Mortar

In [77]:
transactions3.shape

(94073, 16)

In [78]:
markets.columns

Index(['markets_code', 'markets_name', 'zone'], dtype='object')

In [79]:
markets = markets.rename(columns={"markets_code": "market_code", "markets_name": "market_name"})

In [80]:
markets.head(3)

  market_code market_name     zone
0     Mark001     Chennai    South
1     Mark002      Mumbai  Central
2     Mark003   Ahmedabad    North

In [81]:
markets['market_name'].unique()

array(['Chennai', 'Mumbai', 'Ahmedabad', 'Delhi NCR', 'Kanpur',
       'Bengaluru', 'Bhopal', 'Lucknow', 'Patna', 'Kochi', 'Nagpur',
       'Surat', 'Hyderabad', 'Bhubaneshwar'], dtype=object)

In [82]:
markets['market_name'].nunique()

14

In [83]:
markets['zone'].unique()

array(['South', 'Central', 'North'], dtype=object)

In [84]:
markets['zone'].nunique()

3

In [85]:
markets['market_code'].nunique()

15

In [86]:
transactions3['market_code'].nunique()

15

In [87]:
transactions3.shape

(94073, 16)

In [88]:
transactions4 = pd.merge(transactions3, markets, how='inner', on='market_code')

In [89]:
transactions4.head(3)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,profit,total_profit,total_cost,product_type,custmer_name,customer_type,market_name,zone
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51,36704.49,Own Brand,Surge Stores,Brick & Mortar,Chennai,South
1,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,45.37,4536.51,36704.49,Own Brand,Surge Stores,Brick & Mortar,Chennai,South
2,Prod013,Cus001,Mark001,2017-10-10,240,143560.00,INR,598.17,13,520.40,77.76,18662.80,124897.20,Own Brand,Surge Stores,Brick & Mortar,Chennai,South

In [90]:
transactions4.shape

(94073, 18)

In [91]:
date.columns

Index(['date', 'cy_date', 'year', 'month_name', 'date_yy_mmm'], dtype='object')

In [92]:
date = date.rename(columns={"date": "order_date"})

In [93]:
date.head(3)

   order_date     cy_date  year month_name date_yy_mmm
0  2017-06-01  2017-06-01  2017       June      17-Jun
1  2017-06-02  2017-06-01  2017       June      17-Jun
2  2017-06-03  2017-06-01  2017       June      17-Jun

In [94]:
date['order_date'].nunique()

1126

In [95]:
transactions4['order_date'].nunique()

801

In [96]:
transactions4.shape

(94073, 18)

In [97]:
transactions5 = pd.merge(transactions4, date, how='inner', on='order_date')

In [98]:
transactions5.head(3)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,...,total_cost,product_type,custmer_name,customer_type,market_name,zone,cy_date,year,month_name,date_yy_mmm
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,...,36704.49,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
1,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,...,36704.49,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
2,Prod013,Cus001,Mark001,2017-10-10,240,143560.00,INR,598.17,13,520.40,...,124897.20,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct

In [99]:
transactions5.shape

(94073, 22)

In [100]:
transactions5.to_csv('transactions_all.csv', index=False)

In [101]:
transactions5.columns

Index(['product_code', 'customer_code', 'market_code', 'order_date',
       'sales_qty', 'sales_amount', 'currency', 'product_price',
       'profit_percentage', 'original_price', 'profit', 'total_profit',
       'total_cost', 'product_type', 'custmer_name', 'customer_type',
       'market_name', 'zone', 'cy_date', 'year', 'month_name', 'date_yy_mmm'],
      dtype='object')

In [102]:
len(transactions5.columns)

22

In [103]:
transactions5.dtypes

product_code          object
customer_code         object
market_code           object
order_date            object
sales_qty              int64
sales_amount         float64
currency              object
product_price        float64
profit_percentage      int64
original_price       float64
profit               float64
total_profit         float64
total_cost           float64
product_type          object
custmer_name          object
customer_type         object
market_name           object
zone                  object
cy_date               object
year                   int64
month_name            object
date_yy_mmm           object
dtype: object

In [104]:
df = pd.read_csv('./transactions_all.csv')

In [105]:
df.head(2)

,product_code,customer_code,market_code,order_date,sales_qty,sales_amount,currency,product_price,profit_percentage,original_price,...,total_cost,product_type,custmer_name,customer_type,market_name,zone,cy_date,year,month_name,date_yy_mmm
0,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,...,36704.49,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct
1,Prod001,Cus001,Mark001,2017-10-10,100,41241.00,INR,412.41,11,367.04,...,36704.49,Own Brand,Surge Stores,Brick & Mortar,Chennai,South,2017-10-01,2017,October,17-Oct

In [106]:
df.shape

(94073, 22)

In [107]:
df['sales_amount'].sum()

517715529.0

In [108]:
df['total_cost'].sum()

452453089.77

In [109]:
df['total_profit'].sum()

65262439.23000001

In [110]:
df['sales_amount'].sum() - (df['total_cost'].sum() + df['total_profit'].sum())

0.0